# -*- coding: utf-8 -*-
# by Shawn Gu

import openpyxl as ox
import re,os,datetime
from openpyxl.styles import Font

path = "C:/Users/Shawn Gu/Desktop/annual_test"             # files need to be processed from
dest = path                                                # files need to save at

dic = {'(\d*、|\d*\.\s*)成本构成$': '成本分析', '(\d*、|\d*\.\s*)费用按性质分类$': '成本分析', '(\d*、|\d*\.\s*)成本分析$': '成本分析',
       '(\d*、|\d*\.\s*)股份变动$': '股份变动','(\d*、|\d*\.\s*)研发投入$': '研发投入', '(\d*、|\d*\.\s*)成本进行计量$': '折旧方法', '(\S*|\S*\s*|\S*\s*\S*)折旧方法$': '折旧方法',
       '(\d*、|\d*\.\s*)存货跌价$': '存货跌价准备', '(\d*、|\d*\.\s*)计价方法$': '折旧方法', '(\d*、|\d*\.\s*)本期计提$': '本期计提',
       '(\d*、|\d*\.\s*)货币资金$': '货币资金', '(\d*、|\d*\.\s*)以公允价值计量且其变动计入当期损益\S*资产$': '以公允价值计量且其变动计入当期损益的资产',
       '(\d*、|\d*\.\s*)衍生金融资产$': '衍生金融资产', '(\d*、|\d*\.\s*)应收票据$': '应收票据', '(\d*、|\d*\.\s*)应收账款$': '应收账款',
       '(\d*、|\d*\.\s*)应收账款计提$': '应收账款计提','(\d*、|\d*\.\s*)预付款项$': '预付款项', '(\d*、|\d*\.\s*)应收利息$': '应收利息', '(\d*、|\d*\.\s*)应收股利$': '应收股利',
       '(\d*、|\d*\.\s*)其他应收款$': '其他应收款','(\d*、|\d*\.\s*)其他应收款计提$': '其他应收款计提', '(\d*、|\d*\.\s*)存货$$': '存货', '(\d*、|\d*\.\s*)划分为持有待售的资产$': '划分为持有待售的资产',
       '(\d*、|\d*\.\s*)年内到期的非流动资产$': '一年内到期的非流动资产','(\d*、|\d*\.\s*)其他流动资产$': '其他流动资产', '(\d*、|\d*\.\s*)可供出售金融资产$': '可供出售金融资产', '(\d*、|\d*\.\s*)持有至到期投资$': '持有至到期投资',
       '(\d*、|\d*\.\s*)长期应收款$': '长期应收款', '(\d*、|\d*\.\s*)长期股权投资$': '长期股权投资', '(\d*、|\d*\.\s*)投资性房地产$': '投资性房地产',
       '(\d*、|\d*\.\s*)固定资产$': '固定资产', '(\d*、|\d*\.\s*)在建工程$': '在建工程', '(\d*、|\d*\.\s*)工程物资$': '工程物资',
       '(\d*、|\d*\.\s*)固定资产清理$': '固定资产清理','(\d*、|\d*\.\s*)生物\S*资产$': '生产性生物资产', '(\d*、|\d*\.\s*)油气资产$': '油气资产', '(\d*、|\d*\.\s*)无形资产$': '无形资产',
       '(\d*、|\d*\.\s*)开发支出$': '开发支出','(\d*、|\d*\.\s*)商誉$': '商誉', '(\d*、|\d*\.\s*)长期待摊费用$': '长期待摊费用', '(\d*、|\d*\.\s*)递延所得税资产产(负债)$': '递延所得税资产(负债)',
       '(\d*、|\d*\.\s*)其他非流动资产$': '其他非流动资产', '(\d*、|\d*\.\s*)短期借款$': '短期借款','(\d*、|\d*\.\s*)以公允价值计量且其变动计入当期损益\S*负债$': '以公允价值计量且其变动计入当期损益的负债',
       '(\d*、|\d*\.\s*)衍生金融负债$': '衍生金融负债', '(\d*、|\d*\.\s*)应付票据$': '应付票据', '(\d*、|\d*\.\s*)应付账款$': '应付账款',
       '(\d*、|\d*\.\s*)预收款项$': '预收款项','(\d*、|\d*\.\s*)应付职工薪酬$': '应付职工薪酬', '(\d*、|\d*\.\s*)应交税费$': '应交税费', '(\d*、|\d*\.\s*)应付利息$': '应付利息',
       '(\d*、|\d*\.\s*)应付股利$': '应付股利','(\d*、|\d*\.\s*)其他应付款$': '其他应付款', '(\d*、|\d*\.\s*)划分为持有待售的负债$': '划分为持有待售的负债',
       '(\d*、|\d*\.\s*)年内到期的非流动负债$': '一年内到期的非流动负债','(\d*、|\d*\.\s*)其他流动负债$': '其他流动负债', '(\d*、|\d*\.\s*)长期借款$': '长期借款', '(\d*、|\d*\.\s*)应付债券$': '应付债券',
       '(\d*、|\d*\.\s*)长期应付款$': '长期应付款','(\d*、|\d*\.\s*)长期应付职工薪酬$': '长期应付职工薪酬', '(\d*、|\d*\.\s*)专项应付款$': '专项应付款', '(\d*、|\d*\.\s*)预计负债$': '预计负债',
       '(\d*、|\d*\.\s*)递延收益$': '递延收益', '(\d*、|\d*\.\s*)其他非流动负债$': '其他非流动负债', '(\d*、|\d*\.\s*)股本$': '股本',
       '(\d*、|\d*\.\s*)其他权益工具$': '其他权益工具','(\d*、|\d*\.\s*)资本公积$': '资本公积', '(\d*、|\d*\.\s*)库存股$': '库存股', '(\d*、|\d*\.\s*)其他综合收益$': '其他综合收益',
       '(\d*、|\d*\.\s*)专项储备$': '专项储备', '(\d*、|\d*\.\s*)盈余公积$': '盈余公积',
       '(\d*、|\d*\.\s*)未分配利润$': '未分配利润', '(\d*、|\d*\.\s*)营业收入\S*营业成本$': '营业收入和营业成本', '(\d*、|\d*\.\s*)营业税金$': '营业税金',
       '(\d*、|\d*\.\s*)销售费用$': '销售费用','(\d*、|\d*\.\s*)管理费用$': '管理费用', '(\d*、|\d*\.\s*)财务费用$': '财务费用', '(\d*、|\d*\.\s*)资产减值损失$': '资产减值损失',
       '(\d*、|\d*\.\s*)公允价值\S*收益$': '公允价值变动投资收益','(\d*、|\d*\.\s*)投资收益$': '投资收益', '(\d*、|\d*\.\s*)营业外收入$': '营业外收入', '(\d*、|\d*\.\s*)营业外支出$': '营业外支出',
       '(\d*、|\d*\.\s*)所得税费用$': '所得税费用','(\d*、|\d*\.\s*)现金\S*等价物$': '现金和现金等价物的构成', '(\d*、|\d*\.\s*)经营\S*租赁$': '经营租赁',
       '(\d*、|\d*\.\s*)融资\S*租入$': '融资租入的固定资产', '(\d*、|\d*\.\s*)坏账损失$': '资产减值损失'}

font_red=Font(color='FFFF0000')
font_black=Font(color='FF000000')
for root, Dir, files in os.walk(path):
    for filename in files:
        lap0=datetime.datetime.now()
        wb = ox.load_workbook(os.path.join(root, filename), data_only=True)
        ws = wb.get_sheet_by_name("Table 1")
        for i in range(1,ws.max_row):
            for j in dic.keys():
                try:
                    if re.match(j,ws.cell(row=i, column=1).value):
                        ws.cell(row=i,column=1).font=font_red
                except:
                    ws.cell(row=i,column=1).font=font_black
        lap1=datetime.datetime.now()
        wb.save(dest+filename)
        print(filename,' Done: ',lap1-lap0)
print("*** ALL DONE ***")