# -*- coding: utf-8 -*-
# by Shawn Gu

import openpyxl as ox
import numpy as np
import pandas as pd
import re

fs = pd.read_excel('C:/Users/Shawn Gu/Desktop/4proj/模板.xlsx', sheetname='BS_consolidated', skiprows=[0, 1])
fs = fs.fillna(0)
fs = fs.set_index(['Tickers', 'FY'])
fs = pd.DataFrame(fs.stack()).reset_index()
fs.columns = ['Tickers', 'FY', 'Code', 'Value']
print('FS to pandas DataFrame Done')

dic = {'(\S*|\s*)销售费用(\S*|\s*)薪(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '成本分析(\S*|\s*)材料(\S*|\s*)': ['利润表', '营业成本', '原材料成本', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)展览(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)工会(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)拓展(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)长期股权(\S*|\s*)': ['利润表', '投资净收益', '长期股权投资产生的投资收益(处置)', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)社保(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)手续(\S*|\s*)': ['利润表', '财务费用', '金融业务手续费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)折旧(\S*|\s*)': ['利润表', '销售费用', '折旧及摊销', '', ''],
       '成本分析(\S*|\s*)社保(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)劳(\S*|\s*)务(\S*|\s*)': ['利润表', '销售费用', '劳务费', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)赔(\S*|\s*)': ['利润表', '营业外支出', '赔偿及罚款支出', '', ''],
       '成本分析(\S*|\s*)': ['利润表', '营业成本', '其他制造相关成本', '', ''],
       '成本分析(\S*|\s*)饲料(\S*|\s*)': ['利润表', '营业成本', '饲料成本', '', ''],
       '成本分析(\S*|\s*)半成品(\S*|\s*)': ['利润表', '营业成本', '原材料成本', '', ''],
       '成本分析(\S*|\s*)其他费用(\S*|\s*)': ['利润表', '营业成本', '其他制造相关成本', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)促销(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)市场开发(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)人工(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)劳(\S*|\s*)务(\S*|\s*)': ['利润表', '管理费用', '劳务费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)公积金(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)非流动资产(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外支出', '非流动资产处置损失', '', ''],
       '成本分析(\S*|\s*)总计(\S*|\s*)': ['利润表', '营业成本', '', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)非货币(\S*|\s*)交换(\S*|\s*)': ['利润表', '营业外支出', '非货币性资产交换损失', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)未确认融资(\S*|\s*)': ['利润表', '财务费用', '利息支出', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)代缴(\S*|\s*)': ['利润表', '营业外收入', '其他营业外收入', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)股权收购(\S*|\s*)溢价(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)工(\S*|\s*)保险(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '成本分析(\S*|\s*)服务(\S*|\s*)': ['利润表', '营业成本', '服务成本', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)人员(\S*|\s*)费(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)回(\S*|\s*)负债(\S*|\s*)': ['利润表', '营业外收入', '其他营业外收入', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)资本化(\S*|\s*)': ['利润表', '财务费用', '资本化利息', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)退税(\S*|\s*)': ['利润表', '营业外收入', '政府补助/税金返还', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)委托贷款(\S*|\s*)收(\S*|\s*)': ['利润表', '投资净收益', '委托贷款', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)子公司(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)捐(\S*|\s*)': ['利润表', '营业外支出', '盘亏损失', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)预计(\S*|\s*)': ['利润表', '营业外支出', '其他营业外支出', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)保费(\S*|\s*)': ['利润表', '销售费用', '保险费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)业务(\S*|\s*)': ['利润表', '管理费用', '业务招待费', '', ''],
       '成本分析(\S*|\s*)摊销(\S*|\s*)': ['利润表', '营业成本', '折旧摊销费用', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)生物(\S*|\s*)': ['利润表', '营业外支出', '生物性资产处置损失', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)金融负债(\S*|\s*)公允价值(\S*|\s*)变动(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)其中(\S*|\s*)固定资产(\S*|\s*)': ['利润表', '营业外收入', '固定资产处置损失', '', ''],
       '(\S*|\s*)成本分析': ['利润表', '营业成本', '其他制造相关成本', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)激励(\S*|\s*)': ['利润表', '销售费用', '股权激励', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)保险(\S*|\s*)': ['利润表', '管理费用', '保险费用', '', ''],
       '成本分析(\S*|\s*)股权(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)溢价(\S*|\s*)摊销(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)委托借款(\S*|\s*)收(\S*|\s*)': ['利润表', '投资净收益', '委托贷款', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)拓展(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)其中(\S*|\s*)无形资产(\S*|\s*)': ['利润表', '营业外支出', '无形资产处置损失', '', ''],
       '成本分析(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['利润表', '营业成本', '', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)工程物资(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '工程物资减值损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)工(\S*|\s*)保险(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)拆(\S*|\s*)': ['利润表', '营业外支出', '其他营业外支出', '', ''],
       '成本分析(\S*|\s*)机械(\S*|\s*)': ['利润表', '营业成本', '机械设备成本', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '其他资产减值损失', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '其他资产减值损失', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)负债(\S*|\s*)': ['利润表', '公允价值变动收益', '以公允价值计量的且其变动计入当期损益的金融负债', '', ''],
       '成本分析(\S*|\s*)运输成本(\S*|\s*)': ['利润表', '营业成本', '交通运输成本', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)债务重组(\S*|\s*)': ['利润表', '营业外支出', '债务重组损失', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)滞纳(\S*|\s*)': ['利润表', '营业外支出', '赔偿及罚款支出', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)公允价值(\S*|\s*)资产(\S*|\s*)': ['利润表', '公允价值变动收益', '以公允价值计量的且其变动计入当期损益的金融资产', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)租(\S*|\s*)水电(\S*|\s*)': ['利润表', '管理费用', '租赁支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)员工(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)社(\S*|\s*)保(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)人力(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)承销(\S*|\s*)': ['利润表', '财务费用', '融资费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)清算(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)保险(\S*|\s*)': ['利润表', '销售费用', '保险费用', '', ''],
       '成本分析(\S*|\s*)公积金(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)补贴(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '成本分析(\S*|\s*)人员(\S*|\s*)费(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)劳(\S*|\s*)保(\S*|\s*)': ['利润表', '管理费用', '劳保费', '', ''],
       '成本分析(\S*|\s*)薪(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)可供出售(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '可供出售金融资产减值损失', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)手续(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '财务费用', '金融业务手续费', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)折价(\S*|\s*)摊销(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '成本分析(\S*|\s*)折旧(\S*|\s*)': ['利润表', '营业成本', '折旧摊销费用', '', ''],
       '成本分析(\S*|\s*)租(\S*|\s*)': ['利润表', '营业成本', '经营性租赁租金', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)津贴(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)固定资产(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '固定资产减值损失', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)非流动资产(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外收入', '总计', '', ''],
       '成本分析(\S*|\s*)航程成本(\S*|\s*)': ['利润表', '营业成本', '交通运输成本', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)税(\S*|\s*)返(\S*|\s*)': ['利润表', '营业外收入', '政府补助/税金返还', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)油气(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '资源性资产减值损失', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)捐(\S*|\s*)': ['利润表', '营业外收入', '接受捐赠', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)福利(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)人工(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)原(\S*|\s*)股权(\S*|\s*)公允价值(\S*|\s*)重新计量(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)终止(\S*|\s*)转(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)存货(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '存货跌价损失', '', ''],
       '成本分析(\S*|\s*)员工(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)其(\S*|\s*)他(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外收入', '其他长期资产处置利得', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)贴(\S*|\s*)': ['利润表', '财务费用', '利息支出', '', ''],
       '管理费用(\S*|\s*)业务(\S*|\s*)宣传(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)离职(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)市场推(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)人力(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)违(\S*|\s*)': ['利润表', '营业外支出', '赔偿及罚款支出', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)研(\S*|\s*)': ['利润表', '销售费用', '调研与开发支出', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)公允价值(\S*|\s*)': ['利润表', '投资净收益', '以公允价值计量且其变动计入当期损益的金融资产/负债投资收益(处置)', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)待摊(\S*|\s*)': ['利润表', '管理费用', '折旧及摊销', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)可供出售(\S*|\s*)等(\S*|\s*)': ['利润表', '投资净收益', '可供出售金融资产(持有)', '', ''],
       '成本分析(\S*|\s*)修(\S*|\s*)': ['利润表', '营业成本', '保养成本', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)生物(\S*|\s*)': ['利润表', '营业外收入', '生物性资产处置利得', '', ''],
       '成本分析(\S*|\s*)工资(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '成本分析(\S*|\s*)养(\S*|\s*)': ['利润表', '营业成本', '保养成本', '', ''],
       '成本分析(\S*|\s*)研(\S*|\s*)': ['利润表', '营业成本', '调研开发支出', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)不(\S*|\s*)支付(\S*|\s*)': ['利润表', '营业外收入', '无法支付的款项(因债权人原因确实无法/无需支付的应付款项)', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)教育(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)生物(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外收入', '其他长期资产处置利得', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)参展(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '投资净收益', '其他', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)产品开发(\S*|\s*)': ['利润表', '管理费用', '调研与开发支出', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)在建工程(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '在建工程减值损失', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '成本分析(\S*|\s*)人工(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '公允价值变动收益', '其他公允价值变动收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)离职(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '成本分析(\S*|\s*)物流成本(\S*|\s*)': ['利润表', '营业成本', '交通运输成本', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)基金(\S*|\s*)': ['利润表', '营业外支出', '其他营业外支出', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)坏账(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '坏账损失', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)企业合并(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)补助(\S*|\s*)': ['利润表', '营业外收入', '政府补助/税金返还', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)可供出售(\S*|\s*)期间(\S*|\s*)': ['利润表', '投资净收益', '可供出售金融资产(持有)', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)非货币(\S*|\s*)交换(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)工资(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)持有至到期(\S*|\s*)': ['利润表', '投资净收益', '持有至到期投资(处置)', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)投资成本(\S*|\s*)冲销(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)公积金(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)未确认(\S*|\s*)融资(\S*|\s*)': ['利润表', '财务费用', '利息支出', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)无形资产(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '无形资产减值损失', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)期权分摊(\S*|\s*)': ['利润表', '销售费用', '股权激励', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)商誉(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '商誉减值损失', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)政府(\S*|\s*)': ['利润表', '营业外收入', '政府补助/税金返还', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)可供出售(\S*|\s*)': ['利润表', '投资净收益', '可供出售金融资产(处置)', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)奖(\S*|\s*)': ['利润表', '营业外支出', '其他营业外支出', '', ''],
       '成本分析(\S*|\s*)能源(\S*|\s*)': ['利润表', '营业成本', '能源动力成本', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)展览(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)推广(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)生物(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外收入', '其他长期资产处置利得', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)赔(\S*|\s*)': ['利润表', '营业外收入', '赔偿及罚款收入', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)在建工程(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外收入', '其他长期资产处置利得', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)工资(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)违(\S*|\s*)': ['利润表', '营业外收入', '赔偿及罚款收入', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置交易性(\S*|\s*)': ['利润表', '投资净收益', '交易性金融资产/负债(处置)', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)盘亏(\S*|\s*)': ['利润表', '营业外支出', '盘亏损失', '', ''],
       '(\S*|\s*)成本分析(\S*|\s*)抵消(\S*|\s*)': ['利润表', '营业成本', '抵消', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)递延(\S*|\s*)': ['利润表', '营业外收入', '政府补助/税金返还', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)业务(\S*|\s*)': ['利润表', '销售费用', '业务招待费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)研制(\S*|\s*)': ['利润表', '管理费用', '调研与开发支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)招待(\S*|\s*)': ['利润表', '管理费用', '业务招待费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)工会(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)股份支付(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)促销(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)收银短(\S*|\s*)': ['利润表', '营业外支出', '盘亏损失', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)其(\S*|\s*)他(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外支出', '其他长期资产处置损失', '', ''],
       '成本分析(\S*|\s*)物料(\S*|\s*)': ['利润表', '营业成本', '原材料成本', '', ''],
       '成本分析(\S*|\s*)燃(\S*|\s*)': ['利润表', '营业成本', '能源动力成本', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)长期股权(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '长期股权投资减值损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)折旧(\S*|\s*)': ['利润表', '管理费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)交际费(\S*|\s*)': ['利润表', '销售费用', '业务招待费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)推广(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)宣传(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)股权(\S*|\s*)摊销(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '成本分析(\S*|\s*)财务费用(\S*|\s*)': ['利润表', '营业成本', '其他制造相关成本', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)广告(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)衍生(\S*|\s*)公允价值(\S*|\s*)': ['利润表', '公允价值变动收益', '其中:衍生金融工具产生的公允价值变动收益', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)其中(\S*|\s*)无形资产(\S*|\s*)': ['利润表', '营业外收入', '无形资产处置损失', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)产品开发(\S*|\s*)': ['利润表', '销售费用', '调研与开发支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)应酬(\S*|\s*)': ['利润表', '管理费用', '业务招待费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)员工(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '成本分析(\S*|\s*)福利(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '成本分析(\S*|\s*)动力(\S*|\s*)': ['利润表', '营业成本', '能源动力成本', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)套(\S*|\s*)汇兑(\S*|\s*)': ['利润表', '财务费用', '套期保值汇兑损益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)研制(\S*|\s*)': ['利润表', '销售费用', '调研与开发支出', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)劳(\S*|\s*)护(\S*|\s*)': ['利润表', '销售费用', '劳保费', '', ''],
       '成本分析(\S*|\s*)原(\S*|\s*)料(\S*|\s*)': ['利润表', '营业成本', '原材料成本', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)精算(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)股权(\S*|\s*)': ['利润表', '销售费用', '股权激励', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)开发(\S*|\s*)': ['利润表', '销售费用', '调研与开发支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)薪(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)研(\S*|\s*)': ['利润表', '管理费用', '调研与开发支出', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)盘盈(\S*|\s*)': ['利润表', '营业外收入', '盘盈利得', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)衍生(\S*|\s*)': ['利润表', '投资净收益', '金融衍生品', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)罚(\S*|\s*)': ['利润表', '营业外支出', '赔偿及罚款支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)广告(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)无(\S*|\s*)支付(\S*|\s*)': ['利润表', '营业外收入', '无法支付的款项(因债权人原因确实无法/无需支付的应付款项)', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)公允价值(\S*|\s*)投资性房地产(\S*|\s*)': ['利润表', '公允价值变动收益', '按公允价值计量的投资性房地产', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)期权(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)权益法(\S*|\s*)长期股权(\S*|\s*)': ['利润表', '投资净收益', '权益法核算的长期股权投资收益(持有)', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)现金折扣(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)资产重组(\S*|\s*)': ['利润表', '营业外收入', '重大资产重组相关资产出售收入', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)劳动(\S*|\s*)保险(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)固定资产(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外收入', '固定资产处置损失', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)津贴(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)非货币(\S*|\s*)交换(\S*|\s*)': ['利润表', '营业外收入', '非货币性资产交换利得', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)福利(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)待摊(\S*|\s*)': ['利润表', '销售费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)社(\S*|\s*)保(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)成本法(\S*|\s*)长期股权(\S*|\s*)': ['利润表', '投资净收益', '成本法核算的长期股权投资收益(持有)', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)宣传(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)劳保(\S*|\s*)': ['利润表', '销售费用', '劳保费', '', ''],
       '成本分析(\S*|\s*)制造费用(\S*|\s*)': ['利润表', '营业成本', '其他制造相关成本', '', ''],
       '成本分析(\S*|\s*)劳务(\S*|\s*)': ['利润表', '营业成本', '人工成本', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)税(\S*|\s*)退(\S*|\s*)': ['利润表', '营业外收入', '政府补助/税金返还', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)股份支付(\S*|\s*)': ['利润表', '销售费用', '股权激励', '', ''],
       '成本分析(\S*|\s*)修理(\S*|\s*)': ['利润表', '营业成本', '保养成本', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)摊销(\S*|\s*)': ['利润表', '销售费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)展会(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)': ['利润表', '营业外收入', '其他营业外收入', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)持有至到期(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '持有至到期投资价值损失', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)租(\S*|\s*)': ['利润表', '销售费用', '租赁支出', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)汇兑(\S*|\s*)': ['利润表', '财务费用', '汇兑损益', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)收银长(\S*|\s*)': ['利润表', '营业外收入', '盘盈利得', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)摊销(\S*|\s*)': ['利润表', '管理费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)招待(\S*|\s*)': ['利润表', '销售费用', '业务招待费', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)': ['利润表', '营业外支出', '其他营业外支出', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)人员(\S*|\s*)费(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '成本分析(\S*|\s*)润滑油(\S*|\s*)': ['利润表', '营业成本', '保养成本', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)远期(\S*|\s*)': ['利润表', '投资净收益', '金融衍生品', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)罚(\S*|\s*)': ['利润表', '营业外收入', '赔偿及罚款收入', '', ''],
       '成本分析(\S*|\s*)采购(\S*|\s*)': ['利润表', '营业成本', '外购成本', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)融资(\S*|\s*)费(\S*|\s*)': ['利润表', '财务费用', '融资费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)应酬(\S*|\s*)': ['利润表', '销售费用', '业务招待费', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)补偿(\S*|\s*)': ['利润表', '营业外支出', '赔偿及罚款支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)租(\S*|\s*)': ['利润表', '管理费用', '租赁支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)期权分摊(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)公允价值计量(\S*|\s*)期间(\S*|\s*)': ['利润表', '投资净收益', '以公允价值计量且其变动计入当期损益的金融资产/负债在持有期间的投资收益(持有)',
                                                            '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)补偿(\S*|\s*)': ['利润表', '营业外收入', '赔偿及罚款收入', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)无形资产(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外支出', '无形资产处置损失', '', ''],
       '销售费用(\S*|\s*)业务(\S*|\s*)宣传(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)非常损失(\S*|\s*)': ['利润表', '营业外支出', '非常损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)劳动(\S*|\s*)保险(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '成本分析(\S*|\s*)小计(\S*|\s*)': ['利润表', '营业成本', '', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)补贴(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '成本分析(\S*|\s*)船舶运输(\S*|\s*)': ['利润表', '营业成本', '交通运输成本', '', ''],
       '(\S*|\s*)长期应付职工(\S*|\s*)': ['利润表', '总成本', '工资薪酬(应付工资本年增加数)', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)其中(\S*|\s*)固定资产(\S*|\s*)': ['利润表', '营业外支出', '固定资产处置损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)市场开发(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '长期应付职工薪酬': ['利润表', '总成本', '工资薪酬(应付工资本年增加数)', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)无形资产(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外收入', '无形资产处置损失', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)投资性房(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '投资性房地产减值损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)教育(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)交易性(\S*|\s*)': ['利润表', '公允价值变动收益', '其中:交易性金融资产"', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)保费(\S*|\s*)': ['利润表', '管理费用', '保险费用', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)固定资产(\S*|\s*)处置(\S*|\s*)': ['利润表', '营业外支出', '固定资产处置损失', '', ''],
       '成本分析(\S*|\s*)外购(\S*|\s*)': ['利润表', '营业成本', '外购成本', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)废(\S*|\s*)': ['利润表', '营业外收入', '其他营业外收入', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)利息支出(\S*|\s*)': ['利润表', '财务费用', '利息支出', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)持有至到期(\S*|\s*)期间(\S*|\s*)': ['利润表', '投资净收益', '持有至到期投资(持有)', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)债务重组(\S*|\s*)': ['利润表', '营业外收入', '债务重组利得', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)利息收入(\S*|\s*)': ['利润表', '财务费用', '利息收入', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)技术(\S*|\s*)': ['利润表', '管理费用', '调研与开发支出', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)交易性(\S*|\s*)期间(\S*|\s*)': ['利润表', '投资净收益', '交易性金融资产/负债(持有)', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)生物(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '生产性生物性资产减值损失', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)外派(\S*|\s*)薪(\S*|\s*)': ['利润表', '营业外收入', '其他营业外收入', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)激励(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '(\S*|\s*)营业外收入(\S*|\s*)债权转让(\S*|\s*)': ['利润表', '营业外收入', '其他营业外收入', '', ''],
       '(\S*|\s*)公允价值变动(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK8', '', '', '', '合计'],
       '(\S*|\s*)销售费用(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK1', '', '', '', '合计'],
       '(\S*|\s*)资源(\S*|\s*)合计(\S*|\s*)': ['LINK5', '', '', '', '合计'],
       '(\S*|\s*)生物(\S*|\s*)合计(\S*|\s*)': ['LINK6', '', '', '', '合计'],
       '(\S*|\s*)管理费用(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK2', '', '', '', '合计'],
       '(\S*|\s*)融资租赁(\S*|\s*)': ['LINK1', '', '', '', '合计'],
       '(\S*|\s*)营业外收入(\S*|\s*)其中(\S*|\s*)': ['LINK9', '', '', '', '合计'],
       '(\S*|\s*)营业外收入(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK5', '', '', '', '合计'],
       '固定资产(\S*|\s*)合计(\S*|\s*)': ['LINK2', '', '', '', '合计'],
       '(\S*|\s*)营业外支出(\S*|\s*)其中(\S*|\s*)': ['LINK10', '', '', '', '合计'],
       '(\S*|\s*)其他应收(\S*|\s*)账龄(\S*|\s*)合计(\S*|\s*)': ['LINK4', '', '', '', '合计'],
       '(\S*|\s*)年内到期(\S*|\s*)非流动资产(\S*|\s*)合计(\S*|\s*)': ['LINK14', '', '', '', '合计'],
       '(\S*|\s*)投资收益(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK7', '', '', '', '合计'],
       '无形资产(\S*|\s*)合计(\S*|\s*)': ['LINK3', '', '', '', '合计'],
       '(\S*|\s*)资产减值(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK4', '', '', '', '合计'],
       '(\S*|\s*)应收账款(\S*|\s*)账龄(\S*|\s*)合计(\S*|\s*)': ['LINK2', '', '', '', '合计'],
       '(\S*|\s*)营业外支出(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK6', '', '', '', '合计'],
       '(\S*|\s*)融资租赁(\S*|\s*)合计(\S*|\s*)': ['LINK4', '', '', '', '合计'],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)合计(\S*|\s*)': ['LINK12', '', '', '', '合计'],
       '(\S*|\s*)财务费用(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK3', '', '', '', '合计'],
       '(\S*|\s*)其他应付(\S*|\s*)关联(\S*|\s*)借款(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
       '(\S*|\s*)其他应付(\S*|\s*)借款(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)长期(\S*|\s*)租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
       '(\S*|\s*)其他流动负债(\S*|\s*)短期(\S*|\s*)应付债(\S*|\s*)': ['借款', '短期债券', '短期融资券/短期应付债券', '', ''],
       '(\S*|\s*)年内到期(\S*|\s*)债务融资工具(\S*|\s*)': ['借款', '短期债券', '一年内到期的长期债券', '', ''],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)债券(\S*|\s*)': ['借款', '短期债券', '一年内到期的长期债券', '', ''],
       '(\S*|\s*)年内到期(\S*|\s*)借款(\S*|\s*)': ['借款', '短期借款', '一年内到期的长期借款', '', ''],
       '(\S*|\s*)长期借款(\S*|\s*)关联方借款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)永续(\S*|\s*)': ['借款', '长期债券', '永续债', '', ''],
       '(\S*|\s*)长期应付款(\S*|\s*)贷款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)短期借款(\S*|\s*)非银行(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
       '(\S*|\s*)其他流动负债(\S*|\s*)贷款(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
       '(\S*|\s*)长期借款(\S*|\s*)委托(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)其他流动负债(\S*|\s*)关联(\S*|\s*)借款(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
       '(\S*|\s*)其他非流动负债(\S*|\s*)债券(\S*|\s*)': ['借款', '长期债券', '其他长期债券', '', ''],
       '(\S*|\s*)短期借款(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
       '(\S*|\s*)应付债券(\S*|\s*)优先(\S*|\s*)': ['借款', '长期债券', '优先债', '', ''],
       '(\S*|\s*)应付债券(\S*|\s*)转(\S*|\s*)': ['借款', '长期债券', '可转换债券', '', ''],
       '(\S*|\s*)长期应付(\S*|\s*)租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
       '(\S*|\s*)长期借款(\S*|\s*)非银行(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)长期应付(\S*|\s*)国债(\S*|\s*)': ['借款', '长期债券', '其他长期债券', '', ''],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)资(\S*|\s*)管(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
       '(\S*|\s*)其他(\S*|\s*)负债(\S*|\s*)债(\S*|\s*)转(\S*|\s*)贷(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)其他应付(\S*|\s*)融资租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
       '(\S*|\s*)其他非流动负债(\S*|\s*)贷款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)长期借款(\S*|\s*)其(\S*|\s*)他(\S*|\s*)借款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)短期借款(\S*|\s*)委托(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
       '(\S*|\s*)其他流动负债(\S*|\s*)债务融资(\S*|\s*)': ['借款', '短期债券', '短期融资券/短期应付债券', '', ''],
       '(\S*|\s*)长期应付款(\S*|\s*)借款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)短期(\S*|\s*)融资券(\S*|\s*)': ['借款', '短期债券', '短期融资券/短期应付债券', '', ''],
       '(\S*|\s*)长期应付(\S*|\s*)债(\S*|\s*)转(\S*|\s*)贷(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
       '(\S*|\s*)长期应付(\S*|\s*)年内到期(\S*|\s*)租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)长期借款(\S*|\s*)': ['借款', '短期借款', '一年内到期的长期借款', '', ''],
       '(\S*|\s*)短期借款(\S*|\s*)': ['借款', '短期借款', '短期银行借款', '', ''],
       '(\S*|\s*)长期借款(\S*|\s*)': ['借款', '长期借款', '长期银行借款', '', ''],
       '其他非流动资产(\S*|\s*)债券(\S*|\s*)': ['借款', '长期债券', '其他长期债券', '', ''],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
       '(\S*|\s*)长期应付(\S*|\s*)债券(\S*|\s*)': ['借款', '长期债券', '其他长期债券', '', ''],
       '固定资产(\S*|\s*)船舶(\S*|\s*)': ['长期资产', '固定资产', '机车，船舶，飞机，发动机及发电机', '总值', ''],
       '固定资产(\S*|\s*)发电机(\S*|\s*)': ['长期资产', '固定资产', '机车，船舶，飞机，发动机及发电机', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)电(\S*|\s*)权(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)热权(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '(\S*|\s*)油气资产(\S*|\s*)井(\S*|\s*)': ['长期资产', '单独于固定资产的资源性资产', '井巷工程', '总值', ''],
       '固定资产(\S*|\s*)装修(\S*|\s*)': ['长期资产', '固定资产', '建筑物', '总值', ''],
       '(\S*|\s*)资源(\S*|\s*)未探(\S*|\s*)矿(\S*|\s*)权(\S*|\s*)': ['长期资产', '单独于固定资产的资源性资产', '未探明矿区权益', '总值', ''],
       '无形资产(\S*|\s*)土地(\S*|\s*)使用(\S*|\s*)': ['长期资产', '无形资产', '土地/海域使用权', '总值', ''],
       '(\S*|\s*)固定资产(\S*|\s*)租(\S*|\s*)': ['长期资产', '固定资产', '融资租赁', '总值', ''],
       '无形资产(\S*|\s*)品牌(\S*|\s*)': ['长期资产', '无形资产', '商标权', '总值', ''],
       '无形资产(\S*|\s*)专项许可(\S*|\s*)': ['长期资产', '无形资产', '专利权', '总值', ''],
       '无形资产(\S*|\s*)探(\S*|\s*)': ['长期资产', '无形资产', '探明矿物权', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)其他(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产', '总值', ''],
       '固定资产(\S*|\s*)管(\S*|\s*)': ['长期资产', '固定资产', '建筑物', '总值', ''],
       '固定资产(\S*|\s*)轮(\S*|\s*)': ['长期资产', '固定资产', '机车，船舶，飞机，发动机及发电机', '总值', ''],
       '固定资产(\S*|\s*)发动机(\S*|\s*)': ['长期资产', '固定资产', '机车，船舶，飞机，发动机及发电机', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)车位使用权(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产', '总值', ''],
       '固定资产(\S*|\s*)土地(\S*|\s*)': ['长期资产', '固定资产', '土地', '总值', ''],
       '(\S*|\s*)固定资产(\S*|\s*)临时设施(\S*|\s*)': ['长期资产', '固定资产', '其他固定资产', '总值', ''],
       '固定资产(\S*|\s*)计算机(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)认证(\S*|\s*)': ['长期资产', '无形资产', '专利权', '总值', ''],
       '无形资产(\S*|\s*)版权(\S*|\s*)': ['长期资产', '无形资产', '版权/著作权', '总值', ''],
       '无形资产(\S*|\s*)客户关系(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '固定资产(\S*|\s*)公路(\S*|\s*)': ['长期资产', '固定资产', '路桥资产', '总值', ''],
       '无形资产(\S*|\s*)营(\S*|\s*)权(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '固定资产(\S*|\s*)电器(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '固定资产(\S*|\s*)其他(\S*|\s*)': ['长期资产', '固定资产', '其他固定资产', '总值', ''],
       '固定资产(\S*|\s*)运输(\S*|\s*)工具(\S*|\s*)': ['长期资产', '固定资产', '运输工具', '总值', ''],
       '固定资产(\S*|\s*)车辆(\S*|\s*)': ['长期资产', '固定资产', '运输工具', '总值', ''],
       '固定资产(\S*|\s*)港口(\S*|\s*)': ['长期资产', '固定资产', '机场及港口设施', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)商标(\S*|\s*)权(\S*|\s*)': ['长期资产', '无形资产', '商标权', '总值', ''],
       '固定资产(\S*|\s*)供(\S*|\s*)设(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '固定资产(\S*|\s*)生产(\S*|\s*)设备(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '无形资产(\S*|\s*)产权(\S*|\s*)': ['长期资产', '无形资产', '专利权', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)牌照(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '固定资产(\S*|\s*)建筑物(\S*|\s*)': ['长期资产', '固定资产', '建筑物', '总值', ''],
       '无形资产(\S*|\s*)其他(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产', '总值', ''],
       '无形资产(\S*|\s*)商标(\S*|\s*)': ['长期资产', '无形资产', '商标权', '总值', ''],
       '固定资产(\S*|\s*)运(\S*|\s*)设(\S*|\s*)': ['长期资产', '固定资产', '运输工具', '总值', ''],
       '(\S*|\s*)资源(\S*|\s*)探(\S*|\s*)矿(\S*|\s*)权(\S*|\s*)': ['长期资产', '单独于固定资产的资源性资产', '探明矿区权益', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)冠名(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '固定资产(\S*|\s*)井巷(\S*|\s*)': ['长期资产', '固定资产', '井巷工程', '总值', ''],
       '固定资产(\S*|\s*)机车(\S*|\s*)': ['长期资产', '固定资产', '机车，船舶，飞机，发动机及发电机', '总值', ''],
       '无形资产(\S*|\s*)技术(\S*|\s*)': ['长期资产', '无形资产', '专有技术', '总值', ''],
       '固定资产(\S*|\s*)房屋(\S*|\s*)': ['长期资产', '固定资产', '建筑物', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)著作(\S*|\s*)': ['长期资产', '无形资产', '版权/著作权', '总值', ''],
       '(\S*|\s*)固定资产(\S*|\s*)通用工具(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '固定资产(\S*|\s*)器具(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '固定资产(\S*|\s*)家具(\S*|\s*)设备(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '无形资产(\S*|\s*)非竞争(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)软件(\S*|\s*)': ['长期资产', '无形资产', '软件', '总值', ''],
       '无形资产(\S*|\s*)许可(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '固定资产(\S*|\s*)发电(\S*|\s*)': ['长期资产', '固定资产', '机车，船舶，飞机，发动机及发电机', '总值', ''],
       '无形资产(\S*|\s*)采矿(\S*|\s*)权(\S*|\s*)': ['长期资产', '无形资产', '开采矿物权', '总值', ''],
       '固定资产(\S*|\s*)构筑物(\S*|\s*)': ['长期资产', '固定资产', '建筑物', '总值', ''],
       '固定资产(\S*|\s*)电站(\S*|\s*)': ['长期资产', '固定资产', '发电设备', '总值', ''],
       '无形资产(\S*|\s*)采伐权(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)模式(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '固定资产(\S*|\s*)家电(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '(\S*|\s*)资源(\S*|\s*)井巷(\S*|\s*)': ['长期资产', '单独于固定资产的资源性资产', '井巷工程', '总值', ''],
       '固定资产(\S*|\s*)坞(\S*|\s*)': ['长期资产', '固定资产', '库场设施', '总值', ''],
       '无形资产(\S*|\s*)设(\S*|\s*)使用权(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产', '总值', ''],
       '固定资产(\S*|\s*)家具(\S*|\s*)': ['长期资产', '固定资产', '其他固定资产', '总值', ''],
       '无形资产(\S*|\s*)房屋使用权(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产', '总值', ''],
       '无形资产(\S*|\s*)海域(\S*|\s*)使用(\S*|\s*)': ['长期资产', '无形资产', '土地/海域使用权', '总值', ''],
       '固定资产(\S*|\s*)飞(\S*|\s*)': ['长期资产', '固定资产', '机车，船舶，飞机，发动机及发电机', '总值', ''],
       '无形资产(\S*|\s*)专有(\S*|\s*)': ['长期资产', '无形资产', '专有技术', '总值', ''],
       '固定资产(\S*|\s*)专用(\S*|\s*)设(\S*|\s*)': ['长期资产', '无形资产', '机械设备', '总值', ''],
       '无形资产(\S*|\s*)批(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)水电增容(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '固定资产(\S*|\s*)融资(\S*|\s*)租(\S*|\s*)': ['长期资产', '固定资产', '融资租赁', '总值', ''],
       '固定资产(\S*|\s*)高价(\S*|\s*)': ['长期资产', '固定资产', '高价周转件', '总值', ''],
       '(\S*|\s*)固定资产(\S*|\s*)行政(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)土地(\S*|\s*)': ['长期资产', '无形资产', '土地/海域使用权', '总值', ''],
       '固定资产(\S*|\s*)机器设备(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '固定资产(\S*|\s*)仪(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '无形资产(\S*|\s*)高速(\S*|\s*)权(\S*|\s*)': ['长期资产', '无形资产', '路桥资产(经营权)', '总值', ''],
       '(\S*|\s*)生物(\S*|\s*)': ['长期资产', '生物性资产', '生物性资产', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)注册费(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '固定资产(\S*|\s*)港(\S*|\s*)设(\S*|\s*)': ['长期资产', '固定资产', '机场及港口设施', '总值', ''],
       '无形资产(\S*|\s*)系统(\S*|\s*)': ['长期资产', '无形资产', '软件', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)土地(\S*|\s*)所有权(\S*|\s*)': ['长期资产', '无形资产', '土地/海域使用权', '总值', ''],
       '无形资产(\S*|\s*)非专(\S*|\s*)': ['长期资产', '无形资产', '非专利权', '总值', ''],
       '(\S*|\s*)固定资产(\S*|\s*)医(\S*|\s*)设备(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)未结算订单(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '固定资产(\S*|\s*)装卸(\S*|\s*)': ['长期资产', '固定资产', '装卸设备', '总值', ''],
       '(\S*|\s*)固定资产(\S*|\s*)': ['长期资产', '固定资产', '其他固定资产', '总值', ''],
       '无形资产(\S*|\s*)使用权(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '固定资产(\S*|\s*)库场(\S*|\s*)': ['长期资产', '固定资产', '库场设施', '总值', ''],
       '无形资产(\S*|\s*)专利(\S*|\s*)': ['长期资产', '无形资产', '专利权', '总值', ''],
       '(\S*|\s*)资源(\S*|\s*)其他(\S*|\s*)': ['长期资产', '单独于固定资产的资源性资产', '其他单独于固定资产的资源性资产', '总值', ''],
       '固定资产(\S*|\s*)办公(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '无形资产(\S*|\s*)租赁(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)注册(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '固定资产(\S*|\s*)电子(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '无形资产(\S*|\s*)销(\S*|\s*)网(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '(\S*|\s*)固定资产(\S*|\s*)专项设备(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '(\S*|\s*)油气资产(\S*|\s*)': ['长期资产', '单独于固定资产的资源性资产', '其他单独于固定资产的资源性资产', '总值', ''],
       '固定资产(\S*|\s*)通用(\S*|\s*)设备(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '固定资产(\S*|\s*)码头(\S*|\s*)': ['长期资产', '固定资产', '机场及港口设施', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)广告(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '无形资产(\S*|\s*)客户(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)牌誉(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '固定资产(\S*|\s*)传导设备(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '无形资产(\S*|\s*)特许(\S*|\s*)经营(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)水(\S*|\s*)权(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产(不可剥离亦无合同性)', '总值', ''],
       '固定资产(\S*|\s*)机械(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '固定资产(\S*|\s*)通讯(\S*|\s*)': ['长期资产', '固定资产', '电子及办公室设备', '总值', ''],
       '(\S*|\s*)无形资产(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产', '总值', ''],
       '无形资产(\S*|\s*)工业(\S*|\s*)产权(\S*|\s*)': ['长期资产', '无形资产', '其他无形资产', '总值', ''],
       '固定资产(\S*|\s*)机(\S*|\s*)设备(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '固定资产(\S*|\s*)改良(\S*|\s*)': ['长期资产', '固定资产', '建筑物', '总值', ''],
       '(\S*|\s*)固定资产(\S*|\s*)设备(\S*|\s*)': ['长期资产', '固定资产', '机械设备', '总值', ''],
       '(\S*|\s*)油气资产(\S*|\s*)未探明(\S*|\s*)': ['长期资产', '单独于固定资产的资源性资产', '未探明矿区权益', '总值', ''],
       '(\S*|\s*)油气资产(\S*|\s*)探明(\S*|\s*)': ['长期资产', '单独于固定资产的资源性资产', '探明矿区权益', '总值', ''],
       '固定资产(\S*|\s*)船(\S*|\s*)': ['长期资产', '固定资产', '机车，船舶，飞机，发动机及发电机', '总值', ''],
       '无形资产(\S*|\s*)特许(\S*|\s*)': ['长期资产', '无形资产', '特许经营权/营业许可', '总值', ''],
       '(\S*|\s*)买入(\S*|\s*)返售(\S*|\s*)': ['投资', '买入返售金融资产', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                           '买入返售金融资产'],
       '(\S*|\s*)长期应付(\S*|\s*)逆回购(\S*|\s*)': ['投资', '持有至到期投资', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '债券投资'],
       '(\S*|\s*)长期应付(\S*|\s*)未确认(\S*|\s*)融资费(\S*|\s*)': ['/未确认融资费/', '', '', '', '合计'],
       '(\S*|\s*)长期应付(\S*|\s*)合计(\S*|\s*)': ['/长期应付合计/', '', '', '', '合计'],
       '(\S*|\s*)长期应收(\S*|\s*)债(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)以公允价值计量(\S*|\s*)资产(\S*|\s*)股票(\S*|\s*)': ['投资', '交易性金融资产', '权益工具', '按公允价值计量的', '上市股权'],
       '(\S*|\s*)其他流动资产(\S*|\s*)投资(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                               '其他投资'],
       '(\S*|\s*)长期应收(\S*|\s*)合计(\S*|\s*)': ['/长期应收合计/', '', '', '', '合计'],
       '(\S*|\s*)其他综合(\S*|\s*)合计(\S*|\s*)': ['/其他综合收益合计/', '', '', '', '合计'],
       '(\S*|\s*)长期应付(\S*|\s*)股东(\S*|\s*)借款(\S*|\s*)': ['/个人?要不要还?/', '', '', '', '合计'],
       '(\S*|\s*)以公允价值计量(\S*|\s*)资产(\S*|\s*)衍生(\S*|\s*)': ['投资', '交易性金融资产', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                                           '金融衍生品'],
       '(\S*|\s*)以公允价值(\S*|\s*)合计(\S*|\s*)': ['/以公允价值合计/', '', '', '', '合计'],
       '(\S*|\s*)存货(\S*|\s*)合计(\S*|\s*)': ['/存货合计/', '', '', '', '合计'],
       '(\S*|\s*)其他流动资产(\S*|\s*)理财(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                               '理财产品'],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)债券(\S*|\s*)合计(\S*|\s*)': ['/年内债券合计/', '', '', '', '合计'],
       '(\S*|\s*)指定(\S*|\s*)公允(\S*|\s*)其他(\S*|\s*)': ['投资', '指以公允价值计量且其变动计入当期损益金融资产', '其他(混合或无法区分是固定收益还是权益工具)',
                                                      '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他'],
       '销售费用(\S*|\s*)低值(\S*|\s*)易耗(\S*|\s*)': ['//', '', '', '', '合计'],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)长期借款(\S*|\s*)合计(\S*|\s*)': ['/一年内到期', '', '', '', '合计'],
       '(\S*|\s*)应付债券(\S*|\s*)合计(\S*|\s*)': ['/应付债券合计/', '', '', '', '合计'],
       '(\S*|\s*)持有至到期(\S*|\s*)合计(\S*|\s*)': ['/持有至到期合计/', '', '', '', '合计'],
       '(\S*|\s*)成本分析(\S*|\s*)(\S*|\s*)(\S*|\s*)': ['Industry/Product', '', '', '', '合计'],
       '(\S*|\s*)年内到期(\S*|\s*)资产(\S*|\s*)融资(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                                        '其他投资'],
       '(\S*|\s*)其他流动资产(\S*|\s*)债(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)公允价值计量(\S*|\s*)资产(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['投资', '交易性金融资产', '其他(混合或无法区分是固定收益还是权益工具)',
                                                                   '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)其他应收(\S*|\s*)基金(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                             '基金产品'],
       '(\S*|\s*)其他非流动资产(\S*|\s*)融资(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)指定(\S*|\s*)公允(\S*|\s*)基金(\S*|\s*)': ['投资', '指以公允价值计量且其变动计入当期损益金融资产', '其他(混合或无法区分是固定收益还是权益工具)',
                                                      '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '基金产品'],
       '(\S*|\s*)其他流动(\S*|\s*)合计(\S*|\s*)': ['/其他流动合计/', '', '', '', '合计'],
       '(\S*|\s*)其他应收(\S*|\s*)信托(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                             '信托产品'],
       '(\S*|\s*)年内到期(\S*|\s*)资(\S*|\s*)管(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                      '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '资产管理计划'],
       '(\S*|\s*)其他流动资产(\S*|\s*)基金(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                               '基金产品'],
       '(\S*|\s*)年内到期(\S*|\s*)信托(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                             '信托产品'],
       '(\S*|\s*)以公允价值计量(\S*|\s*)资产(\S*|\s*)上市(\S*|\s*)': ['投资', '交易性金融资产', '权益工具', '按公允价值计量的', '上市股权'],
       '(\S*|\s*)B(\S*|\s*)T(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                         '其他投资'],
       '(\S*|\s*)财务费用(\S*|\s*)净(\S*|\s*)': ['/净/', '', '', '', '合计'],
       '(\S*|\s*)其他应收(\S*|\s*)理财(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                             '理财产品'],
       '(\S*|\s*)其他应付(\S*|\s*)合计(\S*|\s*)': ['其他应付合计/', '', '', '', '合计'],
       '(\S*|\s*)其他流动资产(\S*|\s*)结构性(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '理财产品'],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)衍生(\S*|\s*)负债(\S*|\s*)公允价值(\S*|\s*)': ['//', '', '', '', '合计'],
       '(\S*|\s*)负债(\S*|\s*)股东(\S*|\s*)借款(\S*|\s*)': ['/个人?要不要还?/', '', '', '', '合计'],
       '(\S*|\s*)指定(\S*|\s*)公允(\S*|\s*)权益(\S*|\s*)': ['投资', '指以公允价值计量且其变动计入当期损益金融资产', '权益工具',
                                                      '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)应收账款(\S*|\s*)合计(\S*|\s*)': ['/应收账款合计/', '', '', '', '合计'],
       '(\S*|\s*)应收(\S*|\s*)融资租(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)票据(\S*|\s*)合计(\S*|\s*)': ['/年内债券合计/', '', '', '', '合计'],
       '(\S*|\s*)短期借款(\S*|\s*)合计(\S*|\s*)': ['/短期借款合计/', '', '', '', '合计'],
       '(\S*|\s*)其他非流动资产(\S*|\s*)债(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)年内到期(\S*|\s*)资产(\S*|\s*)债(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                                       '其他投资'],
       '(\S*|\s*)应付债券(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)票据(\S*|\s*)': ['/年内债券小计/', '', '', '', '合计'],
       '(\S*|\s*)交易性金融资产(\S*|\s*)衍生(\S*|\s*)': ['投资', '交易性金融资产', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '金融衍生品'],
       '(\S*|\s*)其他应收(\S*|\s*)合计(\S*|\s*)': ['/其他应收合计/', '', '', '', '合计'],
       '(\S*|\s*)其他非流动资产(\S*|\s*)合计(\S*|\s*)': ['/其他非流动资产合计/', '', '', '', '合计'],
       '(\S*|\s*)其他流动资产(\S*|\s*)信托(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                               '信托产品'],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)长期借款(\S*|\s*)小计(\S*|\s*)': ['/一年内到期', '', '', '', '合计'],
       '(\S*|\s*)其他流动负债(\S*|\s*)合计(\S*|\s*)': ['/其他流动负债合计/', '', '', '', '合计'],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)票据(\S*|\s*)小计(\S*|\s*)': ['/年内债券小计/', '', '', '', '合计'],
       '(\S*|\s*)投资性房地产(\S*|\s*)': ['投资', '不动产投资', '其他(混合或无法区分是固定收益还是权益工具)', '按成本计量', '不动产投资'],
       '(\S*|\s*)以公允价值(\S*|\s*)交易性(\S*|\s*)资产(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['投资', '交易性金融资产', '其他(混合或无法区分是固定收益还是权益工具)',
                                                                              '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)以公允价值计量(\S*|\s*)负债(\S*|\s*)衍生(\S*|\s*)': ['投资', '交易性金融负债', '其他(混合或无法区分是固定收益还是权益工具)',
                                                           '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '衍生金融负债'],
       '(\S*|\s*)长期借款(\S*|\s*)合计(\S*|\s*)': ['/长期借款合计/', '', '', '', '合计'],
       '衍生金融资产(\S*|\s*)': ['投资', '其他报表科目', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)销售费用(\S*|\s*)销售业务费(\S*|\s*)': ['//', '', '', '', '合计'],
       '(\S*|\s*)指定(\S*|\s*)公允(\S*|\s*)资产(\S*|\s*)债(\S*|\s*)': ['投资', '指以公允价值计量且其变动计入当期损益金融资产', '固定收益工具',
                                                                '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)其他流动资产(\S*|\s*)资产(\S*|\s*)管理(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                          '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '资产管理计划'],
       '(\S*|\s*)其他流动资产(\S*|\s*)融资(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)年内到期(\S*|\s*)理财(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                             '理财产品'],
       '(\S*|\s*)以公允价值计量(\S*|\s*)交易性金融负债(\S*|\s*)': ['投资', '交易性金融负债', '其他(混合或无法区分是固定收益还是权益工具)',
                                                     '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '衍生金融负债'],
       '(\S*|\s*)年内到期(\S*|\s*)基金(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                             '基金产品'],
       '(\S*|\s*)财务费用(\S*|\s*)未实现(\S*|\s*)融资(\S*|\s*)': ['/未实现融资/', '', '', '', '合计'],
       '(\S*|\s*)其他流动资产(\S*|\s*)资(\S*|\s*)管(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                        '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '资产管理计划'],
       '(\S*|\s*)以公允价值计量(\S*|\s*)资产(\S*|\s*)权益(\S*|\s*)': ['投资', '交易性金融资产', '权益工具', '按公允价值计量的', '上市股权'],
       '管理费用(\S*|\s*)低值(\S*|\s*)易耗(\S*|\s*)': ['//', '', '', '', '合计'],
       '(\S*|\s*)其他非流动资产(\S*|\s*)股权(\S*|\s*)投资(\S*|\s*)': ['投资', '其他报表科目', '权益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                                           '其他投资'],
       '(\S*|\s*)长期应付(\S*|\s*)其中(\S*|\s*)未确认(\S*|\s*)融资费(\S*|\s*)': ['/未确认融资费(已被包括)/', '', '', '', '合计'],
       '(\S*|\s*)投资收益(\S*|\s*)其中(\S*|\s*)': ['//', '', '', '', '合计'],
       '(\S*|\s*)长期借款(\S*|\s*)年内到期(\S*|\s*)': ['/年内到期长期借款/', '', '', '', '合计'],
       '(\S*|\s*)持有至到期(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['投资', '持有至到期投资', '其他(混合或无法区分是固定收益还是权益工具)',
                                                       '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
       '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)债券(\S*|\s*)小计(\S*|\s*)': ['/年内债券小计/', '', '', '', '合计'],
       '(\S*|\s*)其他流动负债(\S*|\s*)衍生(\S*|\s*)': ['投资', '交易性金融负债', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '衍生金融负债'],
       '(\S*|\s*)以公允价值计量(\S*|\s*)资产(\S*|\s*)债(\S*|\s*)': ['投资', '交易性金融资产', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                                          '债券投资'],
       '(\S*|\s*)应付债券(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)债券(\S*|\s*)': ['/年内债券小计/', '', '', '', '合计']}

current_term=2015
last_term=2014

sheetname_bs_2 = ['以公允价值计量且其变动计入当期损益的资产', '其他应付款', '短期借款', '应付债券', '其他流动资产', '工程物资',
                  '一年内到期的非流动资产', '递延收益', '应付利息', '专项应付款', '衍生金融资产','衍生金融负债', '应付票据',
                  '递延所得税资产(负债)', '划分为持有待售的资产', '一年内到期的非流动负债', '预计负债', '划分为持有待售的负债',
                  '其他非流动资产', '货币资金', '其他非流动负债', '应收股利', '应收票据', '其他流动负债', '应收利息', '预收款项',
                  '应交税费', '长期应付职工薪酬', '应付股利', '长期应付款', '长期应收款', '应付账款', '长期借款'] # sheetname, bs , 2 columns
sheetname_bs_4 = ['应付职工薪酬','资本公积','盈余公积']
sheetname_bs_6 = ['持有至到期投资', '存货']
sheetname_bs_10 = ['应收账款', '其他应收款']
sheetname_bs_afs = '可供出售金融资产'
sheetname_bs_oei = '其他权益工具'
sheetname_bs_oci = '其他综合收益'
sheetname_bs_lde = '长期待摊费用'
sheetname_is_2 = ['公允价值变动投资收益','管理费用','投资收益','资产减值损失','营业税金','销售费用','财务费用']

dic_sheetname_bs_2 = {
    '(\S*|\s*)以公允价值计量(\S*|\s*)金融资产(\S*|\s*)债(\S*|\s*)': ['投资', '交易性金融资产', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                                         '债券投资'],
    '(\S*|\s*)以公允价值计量(\S*|\s*)金融资产(\S*|\s*)权益(\S*|\s*)': ['投资', '交易性金融资产', '权益工具', '按公允价值计量的', '上市股权'],
    '(\S*|\s*)以公允价值计量(\S*|\s*)交易性金融负债(\S*|\s*)': ['投资', '交易性金融负债', '其他(混合或无法区分是固定收益还是权益工具)',
                                                  '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '衍生金融负债'],
    '(\S*|\s*)以公允价值计量(\S*|\s*)金融负债(\S*|\s*)衍生(\S*|\s*)': ['投资', '交易性金融负债', '其他(混合或无法区分是固定收益还是权益工具)',
                                                          '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '衍生金融负债'],
    '(\S*|\s*)以公允价值计量(\S*|\s*)金融资产(\S*|\s*)上市(\S*|\s*)': ['投资', '交易性金融资产', '权益工具', '按公允价值计量的', '上市股权'],
    '(\S*|\s*)以公允价值计量(\S*|\s*)资产(\S*|\s*)股票(\S*|\s*)': ['投资', '交易性金融资产', '权益工具', '按公允价值计量的', '上市股权'],
    '(\S*|\s*)以公允价值计量(\S*|\s*)资产(\S*|\s*)衍生(\S*|\s*)': ['投资', '交易性金融资产', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                                        '金融衍生品'],
    '(\S*|\s*)其他应付(\S*|\s*)合计(\S*|\s*)': ['其他应付合计/', '', '', '', '合计'],
    '(\S*|\s*)其他应付(\S*|\s*)关联(\S*|\s*)借款(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
    '(\S*|\s*)其他应付(\S*|\s*)融资租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
    '(\S*|\s*)其他应付(\S*|\s*)借款(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
    '(\S*|\s*)短期借款(\S*|\s*)合计(\S*|\s*)': ['/短期借款合计/', '', '', '', '合计'],
    '(\S*|\s*)短期借款(\S*|\s*)非银行(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
    '(\S*|\s*)短期借款(\S*|\s*)': ['借款', '短期借款', '短期银行借款', '', ''],
    '(\S*|\s*)短期借款(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
    '(\S*|\s*)短期借款(\S*|\s*)委托(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
    '(\S*|\s*)应付债券(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)债券(\S*|\s*)': ['/年内债券小计/', '', '', '', '合计'],
    '(\S*|\s*)应付债券(\S*|\s*)优先(\S*|\s*)': ['借款', '长期债券', '优先债', '', ''],
    '(\S*|\s*)应付债券(\S*|\s*)合计(\S*|\s*)': ['/应付债券合计/', '', '', '', '合计'],
    '(\S*|\s*)应付债券(\S*|\s*)转(\S*|\s*)': ['借款', '长期债券', '可转换债券', '', ''],
    '(\S*|\s*)应付债券(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)票据(\S*|\s*)': ['/年内债券小计/', '', '', '', '合计'],
    '(\S*|\s*)其他流动资产(\S*|\s*)投资(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                            '其他投资'],
    '(\S*|\s*)其他流动资产(\S*|\s*)理财(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                            '理财产品'],
    '(\S*|\s*)其他流动资产(\S*|\s*)债(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)其他流动资产(\S*|\s*)基金(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                            '基金产品'],
    '(\S*|\s*)其他流动资产(\S*|\s*)结构性(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                             '理财产品'],
    '(\S*|\s*)其他流动资产(\S*|\s*)信托(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                            '信托产品'],
    '(\S*|\s*)其他流动资产(\S*|\s*)资产(\S*|\s*)管理(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                       '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '资产管理计划'],
    '(\S*|\s*)其他流动资产(\S*|\s*)融资(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)其他流动资产(\S*|\s*)资(\S*|\s*)管(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                     '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '资产管理计划'],
    '(\S*|\s*)年内到期(\S*|\s*)非流动资产(\S*|\s*)合计(\S*|\s*)': ['LINK14', '', '', '', '合计'],
    '(\S*|\s*)年内到期(\S*|\s*)资产(\S*|\s*)融资(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)年内到期(\S*|\s*)资(\S*|\s*)管(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                   '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '资产管理计划'],
    '(\S*|\s*)年内到期(\S*|\s*)信托(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                          '信托产品'],
    '(\S*|\s*)年内到期(\S*|\s*)资产(\S*|\s*)债(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)年内到期(\S*|\s*)理财(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                          '理财产品'],
    '(\S*|\s*)年内到期(\S*|\s*)基金(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)',
                                          '基金产品'],
    '衍生金融资产(\S*|\s*)': ['投资', '其他报表科目', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)合计(\S*|\s*)': ['LINK12', '', '', '', '合计'],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)长期(\S*|\s*)租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
    '(\S*|\s*)年内到期(\S*|\s*)债务融资工具(\S*|\s*)': ['借款', '短期债券', '一年内到期的长期债券', '', ''],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)债券(\S*|\s*)': ['借款', '短期债券', '一年内到期的长期债券', '', ''],
    '(\S*|\s*)年内到期(\S*|\s*)借款(\S*|\s*)': ['借款', '短期借款', '一年内到期的长期借款', '', ''],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)资(\S*|\s*)管(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)长期借款(\S*|\s*)': ['借款', '短期借款', '一年内到期的长期借款', '', ''],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)债券(\S*|\s*)合计(\S*|\s*)': ['/年内债券合计/', '', '', '', '合计'],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)长期借款(\S*|\s*)合计(\S*|\s*)': ['/一年内到期', '', '', '', '合计'],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)票据(\S*|\s*)合计(\S*|\s*)': ['/年内债券合计/', '', '', '', '合计'],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)长期借款(\S*|\s*)小计(\S*|\s*)': ['/一年内到期', '', '', '', '合计'],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)票据(\S*|\s*)小计(\S*|\s*)': ['/年内债券小计/', '', '', '', '合计'],
    '(\S*|\s*)长期借款(\S*|\s*)年内到期(\S*|\s*)': ['/年内到期长期借款/', '', '', '', '合计'],
    '(\S*|\s*)年内到期(\S*|\s*)非流动负债(\S*|\s*)债券(\S*|\s*)小计(\S*|\s*)': ['/年内债券小计/', '', '', '', '合计'],
    '其他非流动资产(\S*|\s*)债券(\S*|\s*)': ['借款', '长期债券', '其他长期债券', '', ''],
    '(\S*|\s*)其他非流动资产(\S*|\s*)融资(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)其他非流动资产(\S*|\s*)债(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)其他非流动资产(\S*|\s*)合计(\S*|\s*)': ['/其他非流动资产合计/', '', '', '', '合计'],
    '(\S*|\s*)其他非流动资产(\S*|\s*)股权(\S*|\s*)投资(\S*|\s*)': ['投资', '其他报表科目', '权益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)其他非流动负债(\S*|\s*)债券(\S*|\s*)': ['借款', '长期债券', '其他长期债券', '', ''],
    '(\S*|\s*)其他非流动负债(\S*|\s*)贷款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
    '(\S*|\s*)其他流动负债(\S*|\s*)短期(\S*|\s*)应付债(\S*|\s*)': ['借款', '短期债券', '短期融资券/短期应付债券', '', ''],
    '(\S*|\s*)其他流动负债(\S*|\s*)贷款(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
    '(\S*|\s*)其他流动负债(\S*|\s*)关联(\S*|\s*)借款(\S*|\s*)': ['借款', '短期借款', '其他短期借款', '', ''],
    '(\S*|\s*)其他流动负债(\S*|\s*)债务融资(\S*|\s*)': ['借款', '短期债券', '短期融资券/短期应付债券', '', ''],
    '(\S*|\s*)其他流动负债(\S*|\s*)合计(\S*|\s*)': ['/其他流动负债合计/', '', '', '', '合计'],
    '(\S*|\s*)其他流动负债(\S*|\s*)衍生(\S*|\s*)': ['投资', '交易性金融负债', '金融衍生品',
                                            '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '衍生金融负债'],
    '(\S*|\s*)长期应付款(\S*|\s*)贷款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
    '(\S*|\s*)长期应付款(\S*|\s*)借款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
    '(\S*|\s*)长期借款(\S*|\s*)关联方借款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
    '(\S*|\s*)长期借款(\S*|\s*)委托(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
    '(\S*|\s*)长期借款(\S*|\s*)非银行(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
    '(\S*|\s*)长期借款(\S*|\s*)其(\S*|\s*)他(\S*|\s*)借款(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
    '(\S*|\s*)长期借款(\S*|\s*)': ['借款', '长期借款', '长期银行借款', '', ''],
    '(\S*|\s*)长期借款(\S*|\s*)合计(\S*|\s*)': ['/长期借款合计/', '', '', '', '合计'],
    '(\S*|\s*)长期应付(\S*|\s*)租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
    '(\S*|\s*)长期应付(\S*|\s*)国债(\S*|\s*)': ['借款', '长期债券', '其他长期债券', '', ''],
    '(\S*|\s*)长期应付(\S*|\s*)债(\S*|\s*)转(\S*|\s*)贷(\S*|\s*)': ['借款', '长期借款', '其他长期借款', '', ''],
    '(\S*|\s*)长期应付(\S*|\s*)年内到期(\S*|\s*)租(\S*|\s*)': ['借款', '长期借款', '融资性租赁应付款', '', ''],
    '(\S*|\s*)长期应付(\S*|\s*)债券(\S*|\s*)': ['借款', '长期债券', '其他长期债券', '', ''],
    '(\S*|\s*)长期应付(\S*|\s*)逆回购(\S*|\s*)': ['投资', '持有至到期投资', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '债券投资'],
    '(\S*|\s*)长期应付(\S*|\s*)未确认(\S*|\s*)融资费(\S*|\s*)': ['/未确认融资费/', '', '', '', '合计'],
    '(\S*|\s*)长期应付(\S*|\s*)合计(\S*|\s*)': ['/长期应付合计/', '', '', '', '合计'],
    '(\S*|\s*)长期应收(\S*|\s*)债(\S*|\s*)': ['投资', '其他报表科目', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
    '(\S*|\s*)长期应收(\S*|\s*)合计(\S*|\s*)': ['/长期应收合计/', '', '', '', '合计'],
    '(\S*|\s*)长期应付(\S*|\s*)股东(\S*|\s*)借款(\S*|\s*)': ['/个人?要不要还?/', '', '', '', '合计']
}
dic_sheetname_bs_4 = {}   # 无需识别
dic_sheetname_bs_6 = {'(\S*|\s*)持有至到期(\S*|\s*)合计(\S*|\s*)': ['/持有至到期合计/', '', '', '', '合计'],
                      '(\S*|\s*)持有至到期(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['投资', '持有至到期投资', '其他(混合或无法区分是固定收益还是权益工具)',
                                                                      '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资'],
                      '(\S*|\s*)存货(\S*|\s*)合计(\S*|\s*)': ['/存货合计/', '', '', '', '合计']}
dic_sheetname_bs_10 = {'(\S*|\s*)应收账款(\S*|\s*)账龄(\S*|\s*)合计(\S*|\s*)': ['LINK2', '', '', '', '合计'],
                       '(\S*|\s*)应收账款(\S*|\s*)合计(\S*|\s*)': ['/应收账款合计/', '', '', '', '合计'],
                       '(\S*|\s*)其他应收(\S*|\s*)账龄(\S*|\s*)合计(\S*|\s*)': ['LINK4', '', '', '', '合计'],
                       '(\S*|\s*)其他应收(\S*|\s*)基金(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                             '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '基金产品'],
                       '(\S*|\s*)其他应收(\S*|\s*)信托(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                             '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '信托产品'],
                       '(\S*|\s*)其他应收(\S*|\s*)理财(\S*|\s*)': ['投资', '其他报表科目', '其他(混合或无法区分是固定收益还是权益工具)',
                                                             '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '理财产品'],
                       '(\S*|\s*)其他应收(\S*|\s*)合计(\S*|\s*)': ['/其他应收合计/', '', '', '', '合计']}
dic_sheetname_bs_afs = {
    '(\S*|\s*)债务工具(\S*|\s*)投资(\S*|\s*)': ['投资', '可供出售金融资产', '固定收益工具', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他', ''],
    '(\S*|\s*)权益工具(\S*|\s*)公允价值计量(\S*|\s*)股票(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按公允价值计量的', '上市股权', ''],
    '(\S*|\s*)权益工具(\S*|\s*)公允价值计量(\S*|\s*)上市(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按公允价值计量的', '上市股权', ''],
    '(\S*|\s*)权益工具(\S*|\s*)公允价值计量(\S*|\s*)权益(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按公允价值计量的', '上市股权', ''],
    '(\S*|\s*)权益工具(\S*|\s*)公允价值计量(\S*|\s*)基金(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按公允价值计量的', '基金类产品', ''],
    '(\S*|\s*)权益工具(\S*|\s*)公允价值计量(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按公允价值计量的', '其他', ''],
    '(\S*|\s*)权益工具(\S*|\s*)公允价值计量(\S*|\s*)合计(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按公允价值计量的', '其他', ''],
    '(\S*|\s*)权益工具(\S*|\s*)公允价值计量(\S*|\s*)净(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按公允价值计量的', '其他', ''],
    '(\S*|\s*)成本(\S*|\s*)理财(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按成本计量的', '理财产品', ''],
    '(\S*|\s*)*成本(\S*|\s*)信托(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按成本计量的', '信托产品', ''],
    '(\S*|\s*)成本(\S*|\s*)资(\S*|\s*)管(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按成本计量的', '资管计划', ''],
    '(\S*|\s*)成本(\S*|\s*)基金(\S*|\s*)': ['投资', '可供出售金融资产', '权益工具', '按成本计量的', '基金类产品', ''],
    '(\S*|\s*)权益工具(\S*|\s*)套期(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['投资', '可供出售金融资产', '其他(混合或无法区分是固定收益还是权益工具)',
                                                              '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '其他投资', ''],
    '(\S*|\s*)衍生(\S*|\s*)': ['投资', '可供出售金融资产', '金融衍生品', '其他(混合或无法区分是按公允价值计量的还是按成本计量的)', '金融衍生品', '']}
dic_sheetname_bs_oei = {}
dic_sheetname_bs_oci = {}
dic_sheetname_bs_lde = {}
dic_sheetname_is_2 = {'(\S*|\s*)销售费用(\S*|\s*)薪(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)展览(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)工会(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)拓展(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)长期股权(\S*|\s*)': ['利润表', '投资净收益', '长期股权投资产生的投资收益(处置)', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)社保(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)手续(\S*|\s*)': ['利润表', '财务费用', '金融业务手续费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)折旧(\S*|\s*)': ['利润表', '销售费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)劳(\S*|\s*)务(\S*|\s*)': ['利润表', '销售费用', '劳务费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)促销(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)市场开发(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)人工(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)劳(\S*|\s*)务(\S*|\s*)': ['利润表', '管理费用', '劳务费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)公积金(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)未确认融资(\S*|\s*)': ['利润表', '财务费用', '利息支出', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)股权收购(\S*|\s*)溢价(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)工(\S*|\s*)保险(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)人员(\S*|\s*)费(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)资本化(\S*|\s*)': ['利润表', '财务费用', '资本化利息', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)委托贷款(\S*|\s*)收(\S*|\s*)': ['利润表', '投资净收益', '委托贷款', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)子公司(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)保费(\S*|\s*)': ['利润表', '销售费用', '保险费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)业务(\S*|\s*)': ['利润表', '管理费用', '业务招待费', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)金融负债(\S*|\s*)公允价值(\S*|\s*)变动(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)激励(\S*|\s*)': ['利润表', '销售费用', '股权激励', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)保险(\S*|\s*)': ['利润表', '管理费用', '保险费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)溢价(\S*|\s*)摊销(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)委托借款(\S*|\s*)收(\S*|\s*)': ['利润表', '投资净收益', '委托贷款', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)拓展(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)工程物资(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '工程物资减值损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)工(\S*|\s*)保险(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '其他资产减值损失', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '其他资产减值损失', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)负债(\S*|\s*)': ['利润表', '公允价值变动收益', '以公允价值计量的且其变动计入当期损益的金融负债', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)公允价值(\S*|\s*)资产(\S*|\s*)': ['利润表', '公允价值变动收益', '以公允价值计量的且其变动计入当期损益的金融资产', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)租(\S*|\s*)水电(\S*|\s*)': ['利润表', '管理费用', '租赁支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)员工(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)社(\S*|\s*)保(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)人力(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)承销(\S*|\s*)': ['利润表', '财务费用', '融资费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)清算(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)保险(\S*|\s*)': ['利润表', '销售费用', '保险费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)补贴(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)劳(\S*|\s*)保(\S*|\s*)': ['利润表', '管理费用', '劳保费', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)可供出售(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '可供出售金融资产减值损失', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)手续(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '财务费用', '金融业务手续费', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)折价(\S*|\s*)摊销(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)津贴(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)固定资产(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '固定资产减值损失', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)油气(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '资源性资产减值损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)福利(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)人工(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)原(\S*|\s*)股权(\S*|\s*)公允价值(\S*|\s*)重新计量(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)终止(\S*|\s*)转(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)存货(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '存货跌价损失', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)贴(\S*|\s*)': ['利润表', '财务费用', '利息支出', '', ''],
       '管理费用(\S*|\s*)业务(\S*|\s*)宣传(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)离职(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)市场推(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)人力(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)违(\S*|\s*)': ['利润表', '营业外支出', '赔偿及罚款支出', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)研(\S*|\s*)': ['利润表', '销售费用', '调研与开发支出', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)公允价值(\S*|\s*)': ['利润表', '投资净收益', '以公允价值计量且其变动计入当期损益的金融资产/负债投资收益(处置)', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)待摊(\S*|\s*)': ['利润表', '管理费用', '折旧及摊销', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)可供出售(\S*|\s*)等(\S*|\s*)': ['利润表', '投资净收益', '可供出售金融资产(持有)', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)教育(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)参展(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '投资净收益', '其他', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)产品开发(\S*|\s*)': ['利润表', '管理费用', '调研与开发支出', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)在建工程(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '在建工程减值损失', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)其(\S*|\s*)他(\S*|\s*)': ['利润表', '公允价值变动收益', '其他公允价值变动收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)离职(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)坏账(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '坏账损失', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)企业合并(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)可供出售(\S*|\s*)期间(\S*|\s*)': ['利润表', '投资净收益', '可供出售金融资产(持有)', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)非货币(\S*|\s*)交换(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)工资(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)持有至到期(\S*|\s*)': ['利润表', '投资净收益', '持有至到期投资(处置)', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)投资成本(\S*|\s*)冲销(\S*|\s*)': ['利润表', '投资净收益', '非经常投资收益', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)公积金(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)未确认(\S*|\s*)融资(\S*|\s*)': ['利润表', '财务费用', '利息支出', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)无形资产(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '无形资产减值损失', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)期权分摊(\S*|\s*)': ['利润表', '销售费用', '股权激励', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)商誉(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '商誉减值损失', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置(\S*|\s*)可供出售(\S*|\s*)': ['利润表', '投资净收益', '可供出售金融资产(处置)', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)展览(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)推广(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)工资(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)处置交易性(\S*|\s*)': ['利润表', '投资净收益', '交易性金融资产/负债(处置)', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)业务(\S*|\s*)': ['利润表', '销售费用', '业务招待费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)研制(\S*|\s*)': ['利润表', '管理费用', '调研与开发支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)招待(\S*|\s*)': ['利润表', '管理费用', '业务招待费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)工会(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)股份支付(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)促销(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)长期股权(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '长期股权投资减值损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)折旧(\S*|\s*)': ['利润表', '管理费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)交际费(\S*|\s*)': ['利润表', '销售费用', '业务招待费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)推广(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)宣传(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)股权(\S*|\s*)摊销(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '成本分析(\S*|\s*)财务费用(\S*|\s*)': ['利润表', '营业成本', '其他制造相关成本', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)广告(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)衍生(\S*|\s*)公允价值(\S*|\s*)': ['利润表', '公允价值变动收益', '其中:衍生金融工具产生的公允价值变动收益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)产品开发(\S*|\s*)': ['利润表', '销售费用', '调研与开发支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)应酬(\S*|\s*)': ['利润表', '管理费用', '业务招待费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)员工(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)套(\S*|\s*)汇兑(\S*|\s*)': ['利润表', '财务费用', '套期保值汇兑损益', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)研制(\S*|\s*)': ['利润表', '销售费用', '调研与开发支出', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)劳(\S*|\s*)护(\S*|\s*)': ['利润表', '销售费用', '劳保费', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)精算(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)股权(\S*|\s*)': ['利润表', '销售费用', '股权激励', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)开发(\S*|\s*)': ['利润表', '销售费用', '调研与开发支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)薪(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)研(\S*|\s*)': ['利润表', '管理费用', '调研与开发支出', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)衍生(\S*|\s*)': ['利润表', '投资净收益', '金融衍生品', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)广告(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)公允价值(\S*|\s*)投资性房地产(\S*|\s*)': ['利润表', '公允价值变动收益', '按公允价值计量的投资性房地产', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)期权(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)权益法(\S*|\s*)长期股权(\S*|\s*)': ['利润表', '投资净收益', '权益法核算的长期股权投资收益(持有)', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)现金折扣(\S*|\s*)': ['利润表', '财务费用', '其他财务费用或收入', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)劳动(\S*|\s*)保险(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)津贴(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)福利(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)待摊(\S*|\s*)': ['利润表', '销售费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)社(\S*|\s*)保(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)成本法(\S*|\s*)长期股权(\S*|\s*)': ['利润表', '投资净收益', '成本法核算的长期股权投资收益(持有)', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)宣传(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)劳保(\S*|\s*)': ['利润表', '销售费用', '劳保费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)股份支付(\S*|\s*)': ['利润表', '销售费用', '股权激励', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)摊销(\S*|\s*)': ['利润表', '销售费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)展会(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)持有至到期(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '持有至到期投资价值损失', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)租(\S*|\s*)': ['利润表', '销售费用', '租赁支出', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)汇兑(\S*|\s*)': ['利润表', '财务费用', '汇兑损益', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)摊销(\S*|\s*)': ['利润表', '管理费用', '折旧及摊销', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)招待(\S*|\s*)': ['利润表', '销售费用', '业务招待费', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)人员(\S*|\s*)费(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)远期(\S*|\s*)': ['利润表', '投资净收益', '金融衍生品', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)融资(\S*|\s*)费(\S*|\s*)': ['利润表', '财务费用', '融资费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)应酬(\S*|\s*)': ['利润表', '销售费用', '业务招待费', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)补偿(\S*|\s*)': ['利润表', '营业外支出', '赔偿及罚款支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)租(\S*|\s*)': ['利润表', '管理费用', '租赁支出', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)期权分摊(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)公允价值计量(\S*|\s*)期间(\S*|\s*)': ['利润表', '投资净收益', '以公允价值计量且其变动计入当期损益的金融资产/负债在持有期间的投资收益(持有)','', ''],
       '销售费用(\S*|\s*)业务(\S*|\s*)宣传(\S*|\s*)': ['利润表', '销售费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)营业外支出(\S*|\s*)非常损失(\S*|\s*)': ['利润表', '营业外支出', '非常损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)劳动(\S*|\s*)保险(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)销售费用(\S*|\s*)补贴(\S*|\s*)': ['利润表', '销售费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)市场开发(\S*|\s*)': ['利润表', '管理费用', '广告，宣传及促销费', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)投资性房(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '投资性房地产减值损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)教育(\S*|\s*)': ['利润表', '管理费用', '薪酬福利及相关费用', '', ''],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)交易性(\S*|\s*)': ['利润表', '公允价值变动收益', '其中:交易性金融资产"', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)保费(\S*|\s*)': ['利润表', '管理费用', '保险费用', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)利息支出(\S*|\s*)': ['利润表', '财务费用', '利息支出', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)持有至到期(\S*|\s*)期间(\S*|\s*)': ['利润表', '投资净收益', '持有至到期投资(持有)', '', ''],
       '(\S*|\s*)财务费用(\S*|\s*)利息收入(\S*|\s*)': ['利润表', '财务费用', '利息收入', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)技术(\S*|\s*)': ['利润表', '管理费用', '调研与开发支出', '', ''],
       '(\S*|\s*)投资收益(\S*|\s*)交易性(\S*|\s*)期间(\S*|\s*)': ['利润表', '投资净收益', '交易性金融资产/负债(持有)', '', ''],
       '(\S*|\s*)资产减值损失(\S*|\s*)生物(\S*|\s*)': ['利润表', '资产减值损失(当期利润表)', '生产性生物性资产减值损失', '', ''],
       '(\S*|\s*)管理费用(\S*|\s*)激励(\S*|\s*)': ['利润表', '管理费用', '股权激励', '', ''],
       '(\S*|\s*)公允价值变动(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK8', '', '', '', '合计'],
       '(\S*|\s*)销售费用(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK1', '', '', '', '合计'],
       '(\S*|\s*)管理费用(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK2', '', '', '', '合计'],
       '(\S*|\s*)财务费用(\S*|\s*)合(\S*|\s*)计(\S*|\s*)': ['LINK3', '', '', '', '合计'],
       '销售费用(\S*|\s*)低值(\S*|\s*)易耗(\S*|\s*)': ['//', '', '', '', '合计'],
       '(\S*|\s*)财务费用(\S*|\s*)净(\S*|\s*)': ['/净/', '', '', '', '合计'],
       '(\S*|\s*)公允价值变动收益(\S*|\s*)衍生(\S*|\s*)负债(\S*|\s*)公允价值(\S*|\s*)': ['//', '', '', '', '合计'],
       '(\S*|\s*)销售费用(\S*|\s*)销售业务费(\S*|\s*)': ['//', '', '', '', '合计'],
       '(\S*|\s*)财务费用(\S*|\s*)未实现(\S*|\s*)融资(\S*|\s*)': ['/未实现融资/', '', '', '', '合计'],
       '管理费用(\S*|\s*)低值(\S*|\s*)易耗(\S*|\s*)': ['//', '', '', '', '合计']}


bs = [] # 将 bs_2, bs_10 etc放入这个列表, 用于循环识别
wb = ox.load_workbook('D:/pyscripts/extract_FS/Notes.xlsx', data_only=True)

bs_2 = []
for name in sheetname_bs_2:
    ws = wb.get_sheet_by_name(name)
    if ws.max_column != 1:
        tmp_df_2 = pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname=name, header=None)
        tmp_df_2 = tmp_df_2.dropna(how='all')
        tmp_df_2['sheetname'] = [name] * tmp_df_2.shape[0]   # 另加一列, 署名科目
        tmp_df_2.columns = ['Tickers', 'acc_cn', current_term,last_term, 'sheetname']
        tmp_df_2 = tmp_df_2.set_index(['Tickers', 'sheetname', 'acc_cn'])
        tmp_df_2 = pd.DataFrame(tmp_df_2.stack()).reset_index()
        tmp_df_2.columns = ['Tickers','sheetname', 'acc_cn', 'FY', 'Value']
        bs_2.append(tmp_df_2)
    else:
        continue
bs_2 = pd.concat(bs_2, axis=0)
bs.append(bs_2)
print("bs_2 appened")
# _______________________________________________________________________________
bs_4 = []
for name in sheetname_bs_4:
    ws = wb.get_sheet_by_name(name)
    if ws.max_column != 1:
        tmp_df_4 = pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname=name, header=None).dropna(how='all')
        tmp_df_4['sheetname'] = [name] * tmp_df_4.shape[0]
        tmp_df_4.columns = ['Tickers','acc_cn',last_term, 'Increase','Decrease',current_term,'sheetname']
        tmp_df_4=tmp_df_4.set_index(['Tickers','sheetname','acc_cn'])
        tmp_df_4=pd.DataFrame(tmp_df_4.stack()).reset_index()
        tmp_df_4.columns=['Tickers','sheetname','acc_cn','FY','Value']
        bs_4.append(tmp_df_4)
    else:
        continue
bs_4 = pd.concat(bs_4,axis=0)
bs.append(bs_4)
print("bs_4 appened")
# ___________________  AFS  ______________________________________________________

ws = wb.get_sheet_by_name('可供出售金融资产')
if ws.max_column != 1:
    bs_afs = pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname='可供出售金融资产', header=None).dropna(how='all')
    bs_afs = bs_afs[bs_afs[1].notnull()]
    bs_afs['sheetname'] = ['可供出售金融资产'] * bs_afs.shape[0]
    bs_afs['Prefix'] = bs_afs[1][bs_afs[1].map(lambda string: '：' in string)]
    bs_afs['Prefix'] = bs_afs['Prefix'].fillna(method='ffill')
    bs_afs = bs_afs.set_index([0, 'sheetname','Prefix', 1]).dropna(how='all')
    bs_afs.columns = pd.MultiIndex.from_tuples([(current_term, 'Bgn'), (current_term, 'Impairment'), (current_term, 'End'),
                                                (last_term, 'Bgn'), (last_term, 'Impairment'), (last_term, 'End')])
    bs_afs = bs_afs.stack(0)
    bs_afs.index.names = ['Tickers', 'sheetname', 'Prefix', 'acc_cn','FY']
    bs_afs = bs_afs.reset_index()
bs.append(bs_afs)
print('bs_afs appended')
# ________________________________________________________________________________
bs_6 = []
for name in sheetname_bs_6:
    ws = wb.get_sheet_by_name(name)
    if ws.max_column != 1:
        tmp_df_6 = pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname=name, header=None).dropna(how='all')
        tmp_df_6['sheetname'] = [name] * tmp_df_6.shape[0]
        tmp_df_6 = tmp_df_6.set_index([0, 'sheetname', 1]).dropna(how='all')
        tmp_df_6.index.names = ['Tickers', 'sheetname', 'acc_cn']
        tmp_df_6.columns = pd.MultiIndex.from_tuples([(current_term, 'Bgn'), (current_term, 'Impairment'), (current_term, 'End'),
                                                      (last_term, 'Bgn'), (last_term, 'Impairment'), (last_term, 'End')])
        bs_6.append(tmp_df_6)
    else:
        continue
bs_6 = pd.concat(bs_6, axis=0)
bs.append(bs_6)
print('bs_6 appended')

# ________________________________________________________________________________
ws = wb.get_sheet_by_name('其他权益工具')
if ws.max_column != 1:
    bs_oei = pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname='其他权益工具', header=None).dropna(how='all')
    bs_oei['sheetname']=['其他权益工具']*bs_oei.shape[0]
    bs_oei=bs_oei.set_index([0,'sheetname',1])
    bs_oei.columns=pd.MultiIndex.from_tuples([(last_term,'NO.'),(last_term,'Value'),
                                          ('Increase','NO.'),('Increase','Value'),('Decrease','NO.'),
                                          ('Decrease','Value'),(current_term,'NO.'),(current_term,'Value')])
    bs_oei=bs_oei.stack(0)
    bs_oei.index.names = ['Tickers', 'sheetname', 'acc_cn', 'FY']
    bs_oei = bs_oei.reset_index()
bs.append(bs_oei)
print('bs_oei appended')
# ________________________________________________________________________________
ws = wb.get_sheet_by_name('其他综合收益')
if ws.max_column != 1:
    bs_oci = pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname='其他综合收益', header=None).dropna(how='all')
    bs_oci['sheetname'] = ['其他综合收益'] * bs_oci.shape[0]
    bs_oci['Prefix'] = bs_oci[1][bs_oci[1].map(lambda string: '、' in string)]
    bs_oci['Prefix'] = bs_oci['Prefix'].fillna(method='ffill')
    bs_oci=bs_oci.set_index([0,'sheetname','Prefix',1])
    bs_oci.columns=[last_term,'Amount before tax','less: realised through P/L','less: tax','attribute to owners','attribute to minority interest',current_term]
    bs_oci=pd.DataFrame(bs_oci.stack())
    bs_oci.index.names = ['Tickers', 'sheetname', 'Prefix', 'acc_cn','FY']
    bs_oci = bs_oci.reset_index()
bs.append(bs_oci)
print('bs_oci appended')
# ________________________________________________________________________________
ws = wb.get_sheet_by_name('长期待摊费用')
if ws.max_column != 1:
    bs_lde=pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname='长期待摊费用', header=None).dropna(how='all')
    bs_lde['sheetname']=['长期待摊费用']*bs_lde.shape[0]
    bs_lde=bs_lde.set_index([0,'sheetname',1])
    bs_lde.columns=[last_term,'Increase','Amortisation','Decrease',current_term]
    bs_lde=pd.DataFrame(bs_lde.stack())
    bs_lde.columns=["Value"]
    bs_lde.index.names=['Tickers','sheetname','acc_cn','FY']
    bs_lde = bs_lde.reset_index()
bs.append(bs_lde)
print('bs_lde appended')
# _________________________________________________________________________________
bs_10 = []
for name in sheetname_bs_10:
    ws = wb.get_sheet_by_name(name)
    if ws.max_column != 1:
        tmp_df_10 = pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname=name, header=None).dropna(how='all')
        tmp_df_10['sheetname'] = [name] * tmp_df_10.shape[0]
        tmp_df_10 = tmp_df_10.set_index([0, 'sheetname', 1]).dropna(how='all')
        tmp_df_10.columns = pd.MultiIndex.from_tuples(
            [(current_term, 'Bgn'), (current_term, 'portion'), (current_term, 'Impairment'), (current_term, 'rate'), (current_term, 'End'),
             (last_term, 'Bgn'), (last_term, 'portion'), (last_term, 'Impairment'), (last_term, 'rate'), (last_term, 'End')])
        tmp_df_10 = pd.DataFrame(tmp_df_10.stack(0))
        tmp_df_10.index.names = ['Tickers', 'sheetname', 'acc_cn', 'FY']
        tmp_df_10 = tmp_df_10.reset_index()
        bs_10.append(tmp_df_10)
    else:
        continue
bs_10 = pd.concat(bs_10, axis=0)
bs_10 = bs_10.reset_index()
bs.append(bs_10)
print('bs_10 appended')
# ________________________________________________________________________________
is_2=[]
for name in sheetname_is_2:
    ws=wb.get_sheet_by_name(name)
    if ws.max_column != 1:
        tmp_is_2 = pd.read_excel('D:/pyscripts/extract_FS/Notes.xlsx', sheetname=name, header=None).dropna(how='all')
        tmp_is_2['sheetname']=[name]*tmp_is_2.shape[0]
        tmp_is_2.columns=['Tickers','acc_cn',last_term,current_term,'sheetname']
        tmp_is_2=tmp_is_2.set_index(['Tickers','sheetname','acc_cn'])
        is_2.append(tmp_is_2)
is_2 = pd.concat(is_2,axis=0)
is_2 = is_2.reset_index()
bs.append(is_2)
print('is_2 appended')
# _______________________________________________________________________________


# >>>识别
# >>>修正
tmp = []  # 放入recls~

def fc(ls): # 将 bs_~ 与 dic_sheetname_bs_~ 对应
    if ls is bs_2:
        return dic_sheetname_bs_2
    if ls is bs_4:
        return dic_sheetname_bs_4
    elif ls is bs_10:
        return dic_sheetname_bs_10
    elif ls is bs_6:
        return dic_sheetname_bs_6
    elif ls is bs_afs:
        return dic_sheetname_bs_afs
    elif ls is bs_oci:
        return dic_sheetname_bs_oci
    elif ls is bs_lde:
        return dic_sheetname_bs_lde
    elif ls is bs_oei:
        return dic_sheetname_bs_oei
    elif ls is is_2:
        return dic_sheetname_is_2
import pdb;pdb.set_trace()
ls_monitor=0
for ls in bs:
    ls_monitor +=1
    print("ls_monitor: ",ls_monitor)
    recls1 = []
    recls2 = []
    recls3 = []
    recls4 = []
    recls5 = []
    for i in range(len(ls['acc_cn'])):
        print("i->",i)
        for key in fc(ls).keys():
            print("key->",key)
            if re.search(key.encode('utf-8'), (ls['sheetname'].tolist()[i] + '-' + ls['acc_cn'].tolist()[i]).encode('utf-8'))!= None:
                print("try 2")   # ls['sheetname'] -> pd.series
                print("append ls")
                recls1.append(fc(ls)[key][0])
                recls2.append(fc(ls)[key][1])
                recls3.append(fc(ls)[key][2])
                recls4.append(fc(ls)[key][3])
                recls5.append(fc(ls)[key][4])
                break
            else:
                tmp.append(np.nan)
        if len(tmp) == len(fc(ls).keys()):
            recls1.append(np.nan)
            recls2.append(np.nan)
            recls3.append(np.nan)
            recls4.append(np.nan)
            recls5.append(np.nan)
        tmp.clear()
    ls['recls1'] = recls1
    ls['recls2'] = recls2
    ls['recls3'] = recls3
    ls['recls4'] = recls4
    ls['recls5'] = recls5

print('**Done**')